# =============================================================================
# Homebrew Brewfile - macOS Development Environment
# =============================================================================

# Third-party taps
tap "aquaproj/aqua"
tap "cloudquery/tap"
tap "grishka/grishka"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "ngrok/ngrok"
tap "owlinux1000/tap"
tap "shopify/shopify"

# =============================================================================
# System Libraries & Dependencies
# =============================================================================
brew "libpng"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "apr-util"
brew "libssh2"
brew "bzip2"
brew "pcre2"
brew "glib"
brew "libevent"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "pango"
brew "libavif"
brew "gd"
brew "libzip"
brew "libheif"
brew "libraw"
brew "libfido2"
brew "libiconv"
brew "libxml2"
brew "zlib"
brew "pcre"
brew "pkgconf"
brew "re2c"

# =============================================================================
# Core Development Tools & Utilities
# =============================================================================
brew "autoconf"
brew "automake"
brew "bash"
brew "bison"
brew "coreutils"
brew "dateutils"
brew "docutils"
brew "parallel"
brew "perl"
brew "stow"
brew "watch"
brew "wget"

# =============================================================================
# Programming Languages & Version Managers
# =============================================================================
# Python
brew "python@3.9"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "pyenv"
brew "pyenv-virtualenv"
brew "uv"

# Node.js
brew "fnm"
brew "nvm"
brew "volta"

# Go
brew "go"

# PHP
brew "tidy-html5"
brew "php"
brew "composer"

# Terraform
brew "tfenv"

# Runtime Management
brew "mise"

# =============================================================================
# Security & Cryptography
# =============================================================================
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "openssl@1.1"
brew "osv-scanner"

# =============================================================================
# Cloud & DevOps Tools
# =============================================================================
brew "aqua"
brew "argo"
brew "awscli"
brew "cloudquery/tap/cloudquery"

# =============================================================================
# Database & Data Tools
# =============================================================================
brew "mysql", restart_service: :changed
brew "mysql-client"
brew "rtmpdump"
brew "freetds"
brew "sqlparse"

# =============================================================================
# Text Processing & Search Tools
# =============================================================================
brew "bat"
brew "fd"
brew "fzf"
brew "jq"
brew "nkf"
brew "python-yq", link: false
brew "rename"
brew "ripgrep"
brew "xq"
brew "yq"

# =============================================================================
# Git & Version Control
# =============================================================================
brew "gh"
brew "lazygit"

# =============================================================================
# Image & Media Processing
# =============================================================================
brew "jpeg"
brew "jpegoptim"
brew "tesseract"
brew "ffmpeg"
brew "gdk-pixbuf"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "imagemagick"
brew "ghostscript"
brew "yt-dlp"

# =============================================================================
# Terminal & Shell Enhancement
# =============================================================================
brew "neovim"
brew "starship"
brew "tmux"
brew "tree"
brew "zsh"
brew "reattach-to-user-namespace"

# =============================================================================
# macOS-specific Tools
# =============================================================================
brew "blueutil"
brew "pngpaste"

# =============================================================================
# Window Management & System Tools
# =============================================================================
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

# =============================================================================
# Network & VPN Tools
# =============================================================================
brew "openfortivpn"

# =============================================================================
# Specialized Tools
# =============================================================================
brew "cmatrix"
brew "gdrive"
brew "owlinux1000/tap/gcstree"
brew "pwgen"
brew "shopify/shopify/shopify-cli"

# =============================================================================
# GUI Applications (Casks)
# =============================================================================

# Fonts
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Development Tools
cask "gcloud-cli"
cask "ngrok"
cask "slack-cli"
cask "wezterm@nightly"

# System Utilities
cask "hiddenbar"
cask "jordanbaird-ice"
cask "keycastr"
cask "sip-app"

# Communication & File Sharing
cask "neardrop"

# Browsers
cask "thebrowsercompany-dia"
